# Pandas Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd

In [3]:
table = pd.DataFrame({'score':[4, 8, 15, 16, 23, 42]})

In [4]:
table

   score
0      4
1      8
2     15
3     16
4     23
5     42

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
data = [1,4,6,7,6,9,11,13,15,18]

In [8]:
series_data = pd.Series(data)

In [9]:
series_data

0     1
1     4
2     6
3     7
4     6
5     9
6    11
7    13
8    15
9    18
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [10]:
Student = pd.DataFrame({
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
})

In [11]:
Student

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is simply a tabular form of data having rows and columns.

On the other hand, series is a structure having data of a particular column within the table.

Example: The 'Student' which I created in the previous question is a dataframe, but the data created in question2 is a series having values of a single/specific column

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

There are a lots of functins we can use in pandas dataframe:
    
head() and tail(),

describe() --- To analyze the statistical measures of numerical columns in dataframe

count_values()

drop(), dropna(), etc.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [18]:
series_data[6]

11

In [19]:
series_data[6] = 20

In [20]:
series_data

0     1
1     4
2     6
3     7
4     6
5     9
6    20
7    13
8    15
9    18
dtype: int64

In python, Series and Dataframe are mutable while Panel is non-mutable...

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [21]:
maths = [23,53,61,42,25]
english = [44,76,53,82,52]
science = [45,86,74,71,59]

In [22]:
S1 = pd.Series(maths)
S2 = pd.Series(english)
S3 = pd.Series(science)

In [25]:
Record = pd.DataFrame({
    'Marks1':S1,
    'Marks2':S2,
    'Marks3':S3
})

In [26]:
Record

   Marks1  Marks2  Marks3
0      23      44      45
1      53      76      86
2      61      53      74
3      42      82      71
4      25      52      59